
let text = document.getElementById('text');
let treeLeft = document.getElementById('tree-left');
let treeright = document.getElementById('tree-right');
let gateLeft = document.getElementById('gate-left');
let gateright = document.getElementById('gate-right');

window.addEventListener('scroll', () => {
    let value = window.scrollY;

    text.style.marginTop = value * 0.9 + 'px';
    treeLeft.style.left = value * -1 + 'px';
    treeright.style.left = value * 1 + 'px';
    gateLeft.style.left = value * 0.5 + 'px';
    gateright.style.left = value * -0.5 + 'px';
});
const submitBtn = document.getElementById("emotion_submit");
const textInput = document.getElementById("emotion_inputText");
const speakInput = document.getElementById("emotion_inputSpeak");

const emojiOutput = document.getElementById("emotion_outputEmoji");
const textOutput = document.getElementById("emotion_outputText");

submitBtn.addEventListener("click", (ev) => {
  semantic_analysis_api().then((nthEmoji) => {
    
    currentEmotionTexts = emotionTexts[Number(nthEmoji)];
    const randomIndextext = Math.floor(Math.random() * currentEmotionTexts.length);
    const randomIndexemoji = Math.floor(Math.random() *  moji_listm[nthEmoji].length);
    const dedicated_emoji = moji_listm[nthEmoji][randomIndexemoji];
    emojiOutput.innerHTML = dedicated_emoji;
    textOutput.innerHTML = `<div id="emotion_outputText">${currentEmotionTexts[randomIndextext]}</div>`;
  });
});

const semantic_analysis_api = async () => {
  const url = `https://api.aiforthai.in.th/emoji?text=${encodeURIComponent(
    textInput.value
  )}`;
  const headers = {
    Apikey: "6SdwbWBIe03JeTwlhBLKMM4Xyk3KnxHX",
  };

  const requestData = await fetch(url, {
    method: "GET",
    headers: headers,
  }).then((response) => response.json());

  const nthEmoji = Object.keys(requestData).sort(
    (a, b) => requestData[b] - requestData[a]
  )[0];

  return nthEmoji;
};

speakInput.addEventListener("click", (event) => {
  var recognition = new (window.SpeechRecognition ||
    window.webkitSpeechRecognition ||
    window.mozSpeechRecognition ||
    window.msSpeechRecognition)();

  recognition.lang = "th-TH";
  recognition.interimResults = false;
  recognition.maxAlternatives = 5;

  recognition.start();

  recognition.onresult = async (event) => {
    recognitionResult = await event.results[0][0].transcript;
    textInput.value = recognitionResult;
  };
});

// Data storage

const moji_listm =[['🙂','😄','😁','😆','😀','😊','😃'],
['😢','😥','😰','😓','🙁','😟','😞','😔','😣','😫','😩'],
['😡','😠','😤','😖'],
['🙄','😒','😑','😕'],
['😱'],
['😨','😧','😦'],
['😮','😲','😯'],
['😴','😪'],
['😋','😜','😝','😛'],
['😍','💕','😘','😚','😙','😗'],
['😌'],
['😐'],
['😷'],
['😳'],
['😵'],
['💔'],
['😎','😈'],
['🙃','😏','😂','😭'],
['😬','😅','😶'],
['😉'],
['💖','💙','💚','💗','💓','💜','💘','💛'],
['😇']];

const emotionTexts = {
  0: [
    "ฮ่าฮ่าฮ่า วันนี้เธอคงมีความสุขละสิท่า เก็บรอยยิ้มของวันนี้ไว้เยอะ ๆ เธอน่ะเหมาะกับคำว่ายิ้มที่สุดแล้ว",
    "นี้ เธอกำลังมีความสุขอยู่แน่ ๆ เลย คงความสดใสเอาไว้นะ",
    "ความสุขตามที่พระพุทธเจ้าสอนนั้น...เป็นความสุขอันเกิดจากความสันโดษ คือ ยินดีในสิ่งที่ได้ พอใจในสิ่งที่มีโดยไม่ต้องคิดเปรียบเทียบกับคนอื่นมีชีวิตที่เรียบง่าย และไม่เบียดเบียนใคร",
  ],
  1: [
    "อย่าเศร้าไปเลยนะ บางทีอาจจะไม่ได้แย่อย่างที่คิดก็ได้ ลองออกอยู่กับธรรมชาติซักแปปหนึ่งดูก็ได้นะ มันจะทำให้รู้สึกดีขึ้น 🙂",
    "เรารู้นะว่าคุณพยายามเต็มที่แล้วกับสิ่งที่เกิดขึ้น ถึงแม้มันจะทำให้คุณเศร้ามากก็ตาม แต่เราเชื่อว่ายังไงแล้วคุณก็จะผ่านสถานการณ์นี้ไปได้ ถึงแม้อาจจะใช้เวลาหน่อยก็ตามแต่เราจะคอยอยู่ข้าง ๆ คุณเองนะ",
    "คุณต้องรู้สึกเศร้ามากแน่ ๆ เลย แต่เมื่อมันเกิดขึ้นมาแล้ว คนเราก็ไม่สามารถกลับไปแก้ไขอะไรได้หรอกนะ มีเพียงการก้าวเดินต่อไป ถึงแม้ว่าทางนั้นมันอาจจะเดินลำบากแต่เราก็จะค่อยๆก้าวไปด้วยกัน เราเป็นกำลังใจให้คุณเสมอนะ",
    "เราเข้าใจคุณนะ คุณไม่ได้ตัวคนเดียว ยังมีคนที่คอยเป็นกำลังใจให้คุณอยู่ เราคือหนึ่งในนั้นที่เป็นกำลังใจให้คุณไม่ว่าจะเกิดเรื่องอะไรขึ้น",
  ],
  2: [
    "บางครั้งคุณควรที่จะลดอารมณ์ลดสักนิด",
    "เราเข้าใจอารมณ์ของคุณในตอนนี้นะ คุณลองใจเย็น สูดหายใจเข้าออกอย่างช้า ๆ ดู ช่วยได้จริงนะ",
    "ใจเย็น ๆ นะคุณ เรื่องทุกเรื่องมีทางแก้ไขอยู่นะ ลองทำใจให้สงบแล้วคิดทบทวนดูนะงับ มันช่วยให้คุณจัดระเบียบความคิดได้และทำให้คุณเข้าใจอะไร ๆ มากขึ้น ",
    "ลองคิดในอีกมุมมองดูนะ เขาอาจจะมีเหตุผลที่พูดหรือกระทำแบบนั้นกับคุณก็ได้ คุณลองใจเย็นแล้วนั่งคิดทบทวนเรื่องทำลี่เกิดขึ้นดูใหม่อีกที เผื่อคุณอาจจะพูดผิด รับสารมาไม่ตรงกับเขา หรือมีความคิดไม่ตรงกัน ลองนั่งทบทวนแล้วเปิดอกคุยกับเขาดูนะ",
    "เขาอาจจะมีเหตุผลเขาอยู่นะ นั่งสงบสติซักครู่หนึ่งแล้วลองคุยเพื่อทำความเข้าใจกับเขาดูอีกทีนะ",
    "ลองระบายอะไร ๆ ลงในสมุดดูนะ มันช่วยได้เยอะเลยคุณคิดอะไรอยู่ก็เขียนลงไปให้หมด มันจะช่วยให้คุณได้ระบายอารมณ์ออกมาและได้คิดทบทวบไปพร้อม ๆ กัน",
    "เย็นไว้ก่อนนะคุณ ตั้งสติแล้วคิดทบทวบดูดีๆ อาจจะไม่ใช่อย่างที่คุณเข้าใจก็ได้ ลองไปเปิดอกคุยกับเขาดูอีกครั้งหนึ่งเพื่อทำความเข้าใจกันและกันให้มากขึ้นดูนะ",
    "ใจเย็น ลองลิสต์รายการที่อยากทำดู แล้วลุยเลยยย!!! นั่งกินลมชมวิว เดินป่า ปีนภูเขา ทำอาหาร หาอะไรอร่อย ๆ กิน ออกไปเที่ยว ไปวัดไปวา ทำบุญตักบาตร ทำมันให้หมดเลยคุณ สนุกกับการใช้ชีวิตให้ได้มากที่สุด ใช้ให้คุ้ม เพราะเราไม่รู้ว่าเราจะอยู่ได้นานแค่ไหน มีความสุขมาก ๆ นะ",
  ],

  3: [
    "ลองหาอะไรทำดูมั้ย ร้องเพลง เต้น ทำอาหาร หาอะไรอร่อยๆกิน เล่นเกม งี้ มันช่วยให้คุณแก้เบื่อได้นะ ถ้ายังรู้สึกว่ายังไม่หายเบื่อ คุณลองทำความสะอาดบ้าน เดินสำรวจบริเวณบ้าน หรือออกไปที่ที่ไม่เคยไป ทำอะไรที่ไม่เคยทำ คุณอาจจะเจออะไรแปลกใหม่ที่ทำให้คุณรู้สึกดีขึ้นได้นะ ขอให้สนุกกับการทดลองทำอะไรใหม่ ๆ ให้ชีวิตนะ",
    "ออกกำลังดูมั้ย หรือทำสิ่งที่ตัวเองชอบทำ มันดูเหมือนน่าเบื่อแต่ถ้าคุณทำแล้วสนุกไปกับมัน ความเบื่อที่คุณคิดวนไปซ้ำ ๆ ก็จะหายไป เพราะการที่เราทำในสิ่งที่เราชอบมันจะทำให้เรามีความสุขจนลืมวันเวลาไปเลยล่ะ สนุกกับการใช้ชีวิตให้ได้มากที่สุด ใช้ให้คุ้ม มีความสุขมาก ๆ นะ",
    "คุณใจเย็น ๆ ก่อน แต่ฉันก็แอบคล้อยตามคุณนะ มันก็แบบบบ ฉันว่าเรามานั่งคิดเรื่องอย่างอื่นแทนเรื่องนี้ดีกว่า คิดเรื่องนี้ละปวดหัวเนอะ",
    "คุรน้า อย่าอ่อม บูสก่อน อย่าอุ อย่าอุ ทำได้ เชื่อมั่น งานไม่อ่อม ยิ้ม สไมล์ แบบพี่ชอว์",
    "ลองออกไปสูดอากาศสีเขียวดูได้ไหม บางครั้งมันทำให้เราปล่อยเรื่องเดิมไปได้นะ",
    "ออกไปเต้น เอ้า ออกไปเต้น คุณลองเต้นดูสิ เต้นเพลงที่ชอบหรือฝึกเพลงที่ยังไม่เคยเต้น จะแอบเปลี่ยนไปเป็นร้องเพลงก็ได้นะ ชวนคนในครอบครัวมาร้องเพลงด้วยก็ได้นะ ฟังดูน่าสนุกมากๆเลยใช่มั้ยล่ะสนุกกับการใช้ชีวิตให้ได้มากที่สุด ใช้ให้คุ้ม มีความสุขมาก ๆ นะ",
  ],
  5: [
    "จั๊กกิ้มก็คือจิ้งจกส่วนต๊กโตก็คือ… คืออะไรน้อ แตกุ๊ก แฮร่ ไม่ใช่ ตุ๊กแก แฮร่ ถูกแล้วว ยิ้มอยู่ใช่มั้ยล่ะ วันนี้ขอให้เป็นวันที่ดีนะ ลองออกจากสถานที่เดิมๆไปหาอะไรตื่นเต้นๆทำแก้เบื่อได้นะ",
    "อุอุอิอิ งุงิงุงิ งงล่ะสิเราพิมพ์อะไร ยิ้มหน่อยยงับคุณ ถ้าคุณยิ้มทีโลกทั้งใบจะสดใสขึ้นทันทีเลยนะ นั่น ยิ้มรึยังเอ่ย ขอให้เป็นวันที่ดีนะ วันอื่นๆด้วย ยิ้มเข้าไว้นะ",
    "สวัสดีครัชช เป็นไรง่ะ เบื่อขนาดนั้นเลยหรอ หาอะไรทำหน่อยมั้ย คุณจะได้แก้เบื่อแก้เหงา",
  ],
  6: [
    "คุณดูสนใจสิ่ง ๆ นั้นมากเลยนะ มันเจ๋งสุดๆไปเลยสินะคุณ อะไรแบบนี้ทำให้เราตื่นเต้น ใจจดใจจอกับมันมากๆเลยนะ คุณคิดว่ามันดูน่าสนใจใช่มั้ยล่ะ เราก็คิดแบบนั้นเหมือนกัน",
    "โห้ สุดยอด!! จริงหรอคุณอะไรแบบนี้น่ะ มันเจ๋งสุด ๆ ไปเลย คุณเป็นคนที่สนใจอะไรน่าทึ่งๆแบบนี้มันที่ให้คุณดูเป็นคนน่าสนใจมากเลยนะ",
    "จริงหรอ! สิ่งที่คุณสนใจมันน่าทึ่งมาก คุณดูตื่นเต้นมากเลยนะ ก็เพราะว่ามันทำให้คุณรู้สึกว้าวใช่มั้ยล่ะ",
  ],
  7: [
    "คุณดูง่วงนะ ควรไปพักสายตาบ้างนะ ถ้าเราไม่ได้พักผ่อนเป็นเวลานาน อาจเกิดอันตราต่อคุณนะ ยิ่งร่างกายต้องการพักผ่อนมากแค่ไหน ยิ่งเสี่ยงต่อชีวิตคุณมากขึ้นเท่านั้น เพราะฉะนั้นแล้วพักผ่อนให้เพียงพอและดื่มน้ำเยอะ ๆ นะคุณ เพื่อสุขภาพที่ดีของคุณ",
    "การพักผ่อนก็เป็นเรื่องสำคัญสำหรับมนุษย์เรานะ คุณควรไปพักผ่อนสักหน่อยเพื่อสุขภาพนะ ร่างกายของคุณอาจเกิดอาการอ่อนเพลียเหนื่อยล้าเรื้อรังจนทำให้คุณไม่มีสมาธิทำอะไรเลยก็ได้นะ เพื่อสุขภาพที่ดีของคุณเอง",
    "งีบซักหน่อยมั้ยงับ ร่างกายของคุณทำงานหนักเกินขีดจำกัด เลยที่ให้คุณง่วงก็ได้ หรือไม่ก็เพราะว่าคุณอาจจะเบื่อเลยทำให้คุณง่วง",
    "ล้างหน้าด้วยน้ำเย็นดูนะ ช่วยทำให้คุณตื่นตัวได้มากเลยล่ะ หรือไม่ก็ออกกำลังกายดูนะ แต่บางทีคุณอาจจะง่วงเพราะสาเหตุอื่นก็ได้ เช่น ร่างกายทำงานหนัก หรือ เบื่อหน่ายบางสิ่ง มีอีกหลายวิธีที่ทำให้คุณตื่นตัวนะ เดินไปเดินมา ใช้ความคิด หรือยืดเส้นยืดสาย ลองเอาไปทำดูนะ",
  ],
  8: [
    "น่ากินขนาดนี้ต้องลองแล้วมั้ยคุณ ชิมสักนิดนึง ถ้าอร่อยคุณก็ลุยต่อเลย แต่ถ้าไม่ก็พักก่อน",
    "ฮึ้ยยย เริ่ดมาก คุณเคยลองชิมดูแล้วรึยัง มันดูน่ากินมากเลยใช่ไหม ในชีวิตนี้คุณต้องลองชิมมันซักครั้งหนึ่งนะ",
    "หิวเลยง่าา คุณพูดซะนึกภาพออกเลย ดูๆแล้วน่าจะอร่อยมากๆเลยสินะคุณ ต้องลองชิมแล้ว",
    "ลองหาเมนูนั้นทานดูมั้ย มันฟังดูน่ากินน่ารับประทานมากเลยนะ คุณต้องได้ลงมันสักครั้งแล้วล่ะ",
  ],
  9: [
    "ช่วงนี้คุณดูโล่งใจมากเลยนะ ทุกอย่างราบรื่น เป็นสุข ไม่มีทุกข์เหมือนเพลง อารมณ์ดี เลย ชีวิตคุณคงเป็นชีวิตที่ใครหลาย ๆ คนอยากมีสินะ เรายินดีกับคุณด้วยนะ ",
    "สบายเลยสิแบบนี้ ชีวิตคุณเหมือนความฝันเลยนะ แต่ว่าคุณอย่าลืมคิดถึงสิ่งที่ไม่คาดคิดด้วยหล่ะ จงเตรียมพร้อมรับมือกับทุกความเปลี่ยนแปลงที่อาจจะเกิดขึ้นนะ",
    "ปล่อยตัวปล่อยใจสบายชิล ๆ แบบนี้ อย่าลืมโลกแห่งความเป็นจริงล่ะ มันอาจจะใจร้ายมาก ๆ ในบางครั้ง แต่บางครั้งก็ใจดีจนเกินไป คุณต้องมีสติอยู่ตลอดเวลานะ และคอยคิดถึงแผนสำรองไว้ด้วย เผื่อผลที่ตามมาจะอาจจะไม่ได้เป็นอย่างที่คุณหวังไว้นะ",
    "คุณดูสบายใจมากเกินไปนะ คุณควรทำอะไรให้รอบครอบและคิดให้มากขึ้นกว่านี้เพื่อความปลอดภัยของคุณเองนะ",
  ],
  10: [
    "คุณดูตกใจนะ ใจเย็นๆก่อนคุณ ทำใจให้สงบก่อน ถ้าคุณตื่นเต้นมากเกินไปอาจทำให้คุณหายใจไม่ออกก็ได้นะ ตั้งสตินะคุณ ไม่งั้นคุณอาจจะพลาดอะไรไปซักอย่างก็ได้ อะไรแบบนี้ทำให้เราลุ้นตลอดเวลาเลยเนาะ",
    "เย็นไว้ก่อนนะคุณ ตั้งสติก่อน ผลจะออกมาเป็นยังไงก็ได้ คุณมีสติไว้นะ ยิ่งตื่นเต้นอาจจะเสี่ยงอัตราต่อชีวิตคุณได้เลย ไม่เป็นไรนะ เราอยู่ข้างคุณเสมอ",
    "มานั่งตั้งสติก่อนนะคุณ ตอนนี้ยังไม่ว่าอะไรจะเกิดก็ต้องเกิด ถ้าเรามีสติทุกอย่างจะเป็นไปในทางที่ดีนะคุณ",
  ],
  11: [
    "คุณดูหวาดกลัวนะช่วงนี้ ไม่เป็นไรนะคุณ เราอยู่ข้างคุณเสมอ ไม่ต้องขวัญเสียไปเลยนะ คุณนั่งพักก่อนนะ ตั้งสติไว้ก่อนนะ ไม่มีอะไรน่ากลัวหรอก เราเข้าใจว่าคุณกลัวสิ่งที่คุณกำลังเจออยู่ แต่จงเผชิญหน้ากับมันซะ เอาชนะความกลัวนี้ไปให้ได้ ถึงบางครั้งมันจะยากแต่เราจะเป็นกำลังใจให้นะ",
    "ออกไปสูดอากาศหน่อยมั้ย จะได้ผ่อนคลายร่างกาย ไม่ใช่เรื่องแปลกเลยที่คุณจะกลัว ในการเผชิญหน้ากับอุปสรรคต่าง ๆ การเอาชนะใจตัวเองได้เป็นเรื่องที่ยากมากแต่ก็เป็นเรื่องที่ดีมากๆถ้าคุณสามารถทำได้ เราจะอยู่เคียงข้างคุณเสมอนะ เป็นกำลังใจให้นะ",
    "พักนั่งซักครู่นะคุณ ทำใจให้สงบ ปล่อยสมองให้โล่ง การพักผ่อนร่างกายในเวลาแบบนี้เป็นวิธีหนึ่งที่ได้ผลดีมาก คุณอาจจะกลัวสิ่งๆนั้นในตอนนี้ แต่ถ้าคุณก้าวข้ามความกลัวของตัวเองได้ มันจะทำให้คุณเข้มแข็งขึ้นและสามารถทำสิ่งต่าง ๆ ได้มากขึ้นด้วย",
  ],
  12: [
    "หายไว ๆ นะคุณ พักผ่อนให้เพียงพอ ทานข้าวดื่มน้ำทานยาให้ครบทุกมื้อนะ อย่าทานยาเกินล่ะ ดูแลตัวเองดีๆ ไม่นานก็หายไข้หายหวัดแล้ว เป็นกำลังใจให้นะ",
    "อย่าลืมทานยานะงับ ทานอาหารให้ครบ 5 หมู่ด้วย จะได้ช่วยในการเพิ่มประสิทธิภาพของร่างกาย ทำให้ร่างกายแข็งแรง หวัดหรือไข้ที่เป็นอยู่จะได้หายไว ๆ แล้วจะได้ทำอะไรในชีวิตได้ง่ายขึ้น เป็นกำลังใจให้นะ",
    "อาการไม่ค่อยดีเลยนะเนี่ยคุณ พักผ่อนหน่อยไหม ดูเหมือนคุณจะเป็นหวัดเป็นไข้นะ พักดูอาการสักหน่อยก็ดีนะคุณ ถ้ายังไม่ดีขึ้นก็พักงานซัก1วันแล้วกลับมาดูแลตัวเองที่บ้าน ถ้าปล่อยทิ้งไว้อาจจะอันตรายถึงชีวิตคุณเลยนะ",
  ],
  13: [
    "ใจเย็น ๆ นะคุณ ลองคิดทบทวนดูก่อนมั้ย สู้ต่อไปจนถึงที่สุด ไม่ว่าจะต้องดิ้นรนยังไง เราเชื่อว่าคุณทำได้อยูแล้ว เราเชื่อมั่นในตัวคุณนะ ท้อได้แต่อย่าถอย คุณใจเย็นๆก่อน ทำใจดีๆ ทุกอย่างมันมีวิธีแก้ของมัน คุณไม่ต้องห่วงนะ สู้ต่อเพื่อตัวเองและเพื่อคนที่คุณรัก แต่สิ่งสำคัญที่สุดในชีวิตคุณก็คือคุณ ก่อนที่จะรักใครให้คุณรักตัวเองก่อนให้มากๆ ชีวิตคุณคือสิ่งที่มีค่าสำหรับโลกเล็กๆใบนี้ สู้และพยายามต่อไปนะ เป็นกำลังใจให้เสมองับ",
    "คุณกำลังท้ออยู่สินะ ใจเย็น ๆ พักให้สมองโล่งก่อนนะ ชีวิตอาจจะไม่ได้แย่อย่างที่คุณคิดก็ได้ นี่อาจจะเป็นการเริ่มต้นของอะไรหลายๆอย่างก็ได้นะ คุณอย่าพึ่งสิ้นหวังนะ อะไรๆจะดีขึ้นเองตามลำดับขอแค่คุณผ่านมันไปให้ได้เพื่อชีวิตที่ดีขึ้นของคุณและคนที่คุณรักนะ ยังมีผู้คนมากมายที่อาจจะรู้สึกแบบคุณ ในอนาคตคุณอาจจะเป็นคนที่คอยมอบความหวังให้กับผู้คนก็ได้นะ",
  ],
  14: [
    "คุณดูเป็นคนขี้อายนะ ลองฝึกแต่งตัวพร้อมๆกับดูแลตัวเองดูนะ มันจะทำให้คุณมีความมั่นใจมากขึ้น การเผชิญหน้ากับความเขินอายมันเป็นเรื่องที่ดีสำหรับการได้ใช้ชีวิตนะ เป็นกำลังใจให้นะคับบ",
    "หลับตาแล้วหายใจเข้าลึกๆ คุณไม่ต้องกลัวอะไรไปเลยนะ มั่นใจในตัวเองเข้าไว้ ลองฝึกสิ่งที่คุณยังไม่กล้าทำดูนะ ไม่มีใครที่จะมาคอยจับผิดคุณตลอดเวลาหรอก เราเป็นกลังใจให้นะ สู้ ๆ งับบ",
  ],
  15: [
    "โอ๋ ๆ น้าาคุณ เรื่องมันผ่านมาแล้วอย่าไปนึกถึงมันมากนักเลย อะไรที่เราตัดสินใจกันไปแล้วมันแก้อะไรไม่ได้แล้ว เราต้องยอมรับได้แล้วว่าเรากับเขาไม่ได้เป็นอะไรกันแล้ว ถึงจะรักกันแต่ไปกันไม่ได้ อยู่ด้วยกันไปนานๆอาจจะทำให้คุณและเขาเสียเวลาที่จะได้พบเจอคนใหม่ๆนะ ในตอนนี้เราต้องใช้ชีวิตให้คุ้มค่ามากที่สุด ดูแลตัวเอง รักตัวเองให้มาก อยู่กับครอบครัว เพื่อน หรือคนที่อยู่ด้วยแล้วสบายใจ การเริ่มต้นใหม่ไม่ใช่เรื่องที่แย่เลย เป็นเรื่องที่ดีมากสำหรับคนๆหนึ่ง ก้าวเดินต่อไปนะ เป็นกำลังใจให้งับ",
  ],
  16: [
    "คุณเป็นคนมั่นใจในตัวเองมากคนนึงเลยนะ เราดีใจที่ได้เห็นคุณมีความสุขกับการมั่นใจในตัวเอง ขอให้คุณมั่นใจในตัวเองต่อไปนะ",
    "คุณดูดีที่สุดแล้ว) ไม่ต้องสนใจว่าใครจะมองคุณยังไง แค่ดูแลตัวเองให้ดีและมั่นใจในตัวเองเข้าไว้นะ เราเชื่อในตัวคุณว่าคุณจะเป็นคนที่ไม่กลัวการจะเป็นตัวของตัวเอง",
  ],
  17: [
    "ตอนนี้เราไม่รู้ว่าคุณกำลังมีอารมณ์สุดโต่งกับอะไรรึเปล่า แต่ถ้าอารมณ์นี้ไม่ได้ทำคุณเสียใจ ก็ไม่เป็นไรนะ",
    "สุดขีดของอารมณ์คือคุณในตอนนี้ไง เราไม่แน่ใจกับอารมณ์ของคุณเลย เพราะมันเป็นอารมณ์ที่สุดโต่งที่ฉันจะสามารถบรรยายเป็นข้อความให้ได้ แต่ฉันจะให้สีคุณ 1 สี นั้นก็คือ สีม่วง ฉันไม่บอกความหมายหรอกนะ ให้คุณตีความเองเอาละกัน",
    "คุรน้า แอบเวอร์นะ อารมณ์นี้",
  ],
  18: [
    "ตอนนี้เราไม่รู้ว่าคุณกำลังมีอารมณ์สุดโต่งกับอะไรรึเปล่า แต่ถ้าอารมณ์นี้ไม่ได้ทำคุณเสียใจ ก็ไม่เป็นไรนะ",
    "ให้ตัวเองเวลาพักผ่อน ไม่ต้องมีกิจกรรมเสมอ บางครั้งการหยุดพักสักครู่อาจช่วยลดความตึงเครียดได้",
    "คุณลองพยายามมองในแง่บวก และใช้การเปลี่ยนมุมมองเพื่อเห็นความเป็นไปได้ที่ดีขึ้นได้นะ",
    "เออ จะพูดยังไงดี คนมันเกรงใจอะเนอะ",
  ],
  19: [
    "คุณดูเป็นคนขี้เล่นนะ ดูมีความสุขเป็นของตัวเอง แต่ถ้าคุณขี้เล่นตลอดเวลาก็ ไม่ใช่เรื่องที่ดีเสอมไปนะ เล่นให้พอดี ๆ มีความสุขกับการใช้ชีวิตมาก ๆ นะ",
  ],
  20: [
    "ทำบุญเยอะก็ได้บุญเยอะ เริ่ด สุขนี้คือทำถึง",
    "คุณเหมือนแม่พระเลยนะเนี่ย",
    "คุณดูมีความสุขมากๆเลยนะ ดีใจจังที่คุณมีความสุขนะ เราขอให้คุณมีความสุขมากๆๆๆๆๆๆแบบนี้ตลอดไปเลยนะ",
  ],
  21: [
    "มีความหวังดีอยู่รอบ ๆ ตัวคุณอยู่มากมายเลยนะ ลองสังเกตรอบข้างดี ๆ ดู",
    "มีความรักอยู่รอบ ๆ ตัวคุณเลยนะ อย่าเผลอมองข้ามล่ะ",
    "พระเจ้าจะคอยโอบกอดคุณ และเฝ้ามองคุณอยู่ห่าง ๆ อย่างห่วง ๆ",
    "รักที่มากล้น จะคอยอยู่ข้าง ๆ คุณเสมอ",
    "ฮ่าฮ่าฮ่า วันนี้เธอคงมีความสุขละสิท่า เก็บรอยยิ้มของวันนี้ไว้เยอะ ๆ เธอน่ะเหมาะกับคำว่ายิ้มที่สุดแล้ว",
    "นี้ เธอกำลังมีความสุขอยู่แน่ ๆ เลย คงความสดใสเอาไว้นะ",
  ],
};

const submitButton = document.getElementById('emotion_submit');
window.addEventListener('load', function() {
  const images = document.querySelectorAll('.paloma img');
  images.forEach((img, index) => {
      setTimeout(() => {
          img.classList.add('show');
      }, index * 500); // เลื่อนรูปภาพทีละรูปด้วยช่วงเวลา 0.5 วินาที
  });
});
let sections = document.querySelectorAll('section');

window.onscroll = () => {
  sections.forEach(sec => {
    let top = window.scrollY;
    let offset = sec.offsetTop;
    let height = sec.offsetHeight;

    if (top >= offset && top < offset + height) {
      sec.classList.add('show-animate');
    }
    else{
      sec.classList.remove('show-animate');
    }
  })
}

let leftarticle = document.getElementById('left-article');
let rightarticle = document.getElementById('right-article');

let viewportHeight = window.innerHeight;


const animatedImage = document.querySelector('.image-heal-1');
const animatedImage2 = document.querySelector('.image-heal-2');

const animatedImageTimeline = new ScrollTimeline({
  scrollOffet:[
    {target: animatedImage, edge: 'end', therhold: 1},
    {target: animatedImage, edge: 'start', therhold: 1},
  ],
});



animatedImage.animate(
  {
    transform: ['perspective(1000px) rotateX(100deg)','perspective(10000px)  rotateX(70)'],
  },
  {
    duration: 1,
    timeline: animatedImageTimeline,
  }

);
animatedImage2.animate(
  {
    transform: ['perspective(1000px) rotateX(100deg)','perspective(10000px)  rotateX(70)'],
  },
  {
    duration: 1,
    timeline: animatedImageTimeline,
  }

);

